Show / Hide Table of Contents
Class GrpcReflectionCallbackData
Contains response returned from Grpc service.
Inheritance
System.Object
GrpcReflectionCallbackData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionCallbackData
Properties
Improve this Doc   View Source
Value
Value returned from server.
Declaration
public object Value { get; set; }
Property Value
 Type |  Description
 System.Object
Improve this Doc   View Source
ValueType
FullName of the value type.
Declaration
public string ValueType { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source